- 유효한 데이터
- 유즈케이스 있는지 찾아보기
- 진입장벽 : 돌겠네!

In [1]:
# 치매 이야기
# 서울대병원을 가면 ... 육군대위치매노인이 다시 전땅끄로 돌아온다
# 귀담아 들어라 강사의 말을

- https://data.kma.go.kr/stcs/grnd/grndTaList.do?pgmNo=70
- ta_20251028161527.csv 다운

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
# windows 용 한글 폰트 오류 해결
from matplotlib import font_manager, rc

font_path = "C:/Windows/Fonts/malgun.ttf"
font_name = font_manager.FontProperties(fname = font_path).get_name()
rc("font", family = font_name)

In [5]:
df = pd.read_csv("./data/seoul.csv", encoding = 'cp949', skiprows=6)

In [6]:
df.dtypes

날짜          object
지점           int64
평균기온(℃)    float64
최저기온(℃)    float64
최고기온(℃)    float64
dtype: object

In [7]:
df.isna().sum()

날짜           0
지점           0
평균기온(℃)    756
최저기온(℃)    759
최고기온(℃)    759
dtype: int64

In [8]:
df.head()

             날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
0  \t1907-10-01  108     13.5      7.9     20.7
1  \t1907-10-02  108     16.2      7.9     22.0
2  \t1907-10-03  108     16.2     13.1     21.3
3  \t1907-10-04  108     16.5     11.2     22.0
4  \t1907-10-05  108     17.6     10.9     25.4

In [10]:
df.dtypes

날짜          object
지점           int64
평균기온(℃)    float64
최저기온(℃)    float64
최고기온(℃)    float64
dtype: object

In [14]:
# strip
df["날짜"] = df["날짜"].str.strip()

In [18]:
df.head()

           날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
0  1907-10-01  108     13.5      7.9     20.7
1  1907-10-02  108     16.2      7.9     22.0
2  1907-10-03  108     16.2     13.1     21.3
3  1907-10-04  108     16.5     11.2     22.0
4  1907-10-05  108     17.6     10.9     25.4

In [20]:
# 결측치 확인
df.isna().sum()

날짜           0
지점           0
평균기온(℃)    756
최저기온(℃)    759
최고기온(℃)    759
dtype: int64

In [21]:
df[df["평균기온(℃)"].isna()]

               날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
15676  1950-09-01  108      NaN      NaN      NaN
15677  1950-09-02  108      NaN      NaN      NaN
15678  1950-09-03  108      NaN      NaN      NaN
15679  1950-09-04  108      NaN      NaN      NaN
15680  1950-09-05  108      NaN      NaN      NaN
...           ...  ...      ...      ...      ...
16427  1953-11-26  108      NaN      NaN      NaN
16428  1953-11-27  108      NaN      NaN      NaN
16429  1953-11-28  108      NaN      NaN      NaN
16430  1953-11-29  108      NaN      NaN      NaN
16431  1953-11-30  108      NaN      NaN      NaN

[756 rows x 5 columns]

In [22]:
df[df["최고기온(℃)"].isna()]

               날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
15676  1950-09-01  108      NaN      NaN      NaN
15677  1950-09-02  108      NaN      NaN      NaN
15678  1950-09-03  108      NaN      NaN      NaN
15679  1950-09-04  108      NaN      NaN      NaN
15680  1950-09-05  108      NaN      NaN      NaN
...           ...  ...      ...      ...      ...
16430  1953-11-29  108      NaN      NaN      NaN
16431  1953-11-30  108      NaN      NaN      NaN
21260  1967-02-19  108     -1.7      NaN      NaN
23691  1973-10-16  108     12.3      NaN      NaN
39758  2017-10-12  108     11.4      8.8      NaN

[759 rows x 5 columns]

In [23]:
# 무슨일이야!!!!

In [24]:
# 6_25 전쟁, 한국전쟁이요~! 라는 상식이 있어요~!

In [25]:
# 얕고 넓은 지식 , 다소 깊은 지식...이 필요해요~

- 1950년대 6.25 전쟁으로 당시 데이터가 수집되지 않은 것으로 추정
- 1950/06/25 ~ 1953/07/27

In [26]:
df.columns

Index(['날짜', '지점', '평균기온(℃)', '최저기온(℃)', '최고기온(℃)'], dtype='object')

In [27]:
df.columns = [
    "날짜",
    "지점",
    "평균기온",
    "최저기온",
    "최고기온",
]

In [28]:
df.head()

           날짜   지점  평균기온  최저기온  최고기온
0  1907-10-01  108  13.5   7.9  20.7
1  1907-10-02  108  16.2   7.9  22.0
2  1907-10-03  108  16.2  13.1  21.3
3  1907-10-04  108  16.5  11.2  22.0
4  1907-10-05  108  17.6  10.9  25.4

# 데이터 분석

## 서울이 가장 더웠던 날

- 서울이 최고 기온이 가장 높았던 날

In [29]:
df["최고기온"].max()

39.6

In [34]:
df.loc[df["최고기온"].idxmax()]

날짜      2018-08-01
지점             108
평균기온          33.6
최저기온          27.8
최고기온          39.6
Name: 40051, dtype: object

In [35]:
df.sort_values(by="최고기온", ascending = False)

               날짜   지점  평균기온  최저기온  최고기온
40051  2018-08-01  108  33.6  27.8  39.6
31277  1994-07-24  108  33.1  28.1  38.4
40050  2018-07-31  108  32.6  27.8  38.3
31276  1994-07-23  108  32.6  28.0  38.2
13111  1943-08-24  108  29.0  23.2  38.2
...           ...  ...   ...   ...   ...
16430  1953-11-29  108   NaN   NaN   NaN
16431  1953-11-30  108   NaN   NaN   NaN
21260  1967-02-19  108  -1.7   NaN   NaN
23691  1973-10-16  108  12.3   NaN   NaN
39758  2017-10-12  108  11.4   8.8   NaN

[42696 rows x 5 columns]

## 내 생일의 기온 변화

In [36]:
df[df["날짜"] == "1998-09-27"]

               날짜   지점  평균기온  최저기온  최고기온
32803  1998-09-27  108  22.2  17.7  27.3

In [43]:
df[df["날짜"] == "1998-09-27"].index[0]

np.int64(32803)

In [51]:
# 내생일의 데이터를 뽑았다
# 변화를 알고싶다! ( 어디서 부터 어디까지 의 변화냐 !)
my_birth = df.iloc[:df[df["날짜"] == "1998-09-27"].index[0] + 1]

In [52]:
my_birth

               날짜   지점  평균기온  최저기온  최고기온
0      1907-10-01  108  13.5   7.9  20.7
1      1907-10-02  108  16.2   7.9  22.0
2      1907-10-03  108  16.2  13.1  21.3
3      1907-10-04  108  16.5  11.2  22.0
4      1907-10-05  108  17.6  10.9  25.4
...           ...  ...   ...   ...   ...
32799  1998-09-23  108  19.8  15.6  23.5
32800  1998-09-24  108  19.8  16.8  24.6
32801  1998-09-25  108  20.8  16.0  25.6
32802  1998-09-26  108  22.0  18.6  26.6
32803  1998-09-27  108  22.2  17.7  27.3

[32804 rows x 5 columns]